/*/ Використовуючи механізм шаблонного успадкування створіть ієрархію класів.
 *Базовий клас під назвою base має наступні змінні-члени:
 *1) T1 value1;// деяке значення.
 *2) T2 value2; // деяке значення.
 *Нащадок під назвою child містить додаткові змінні-члени:
 *3) T3 value3.
 *4) T4 value4.
 *Нащадок під назвою child2 додає такі змінні-члени:
 *5) T5 value5. 6) T6 value6.
 *Кожен клас має необхідний набір конструкторів, деструкторів, функцій-членів для роботи зі структурою класу.
 *В main протестувати роботу класу.
/*/